Coupon - 挖矿竞赛参与者自动获得相同数量的Coupon，兑换coupon（redeem coupon)变成茶树种子（Camellia)
Camellia - 茶树种子，分三种类型A,B,C, 类型不同的种子生长周期不同，收益也不同，可以质押的slot数量也不同。Coupon兑换后的种子有些解冻，可以立即开始种植；有些还未解冻的需要等到解冻以后进行种植。
TEA token（TEA)- 是TEA Project种的流通代币。TEA Project没有初始发币和空投，所有的TEA都由矿工挖出。TEA的收益大小由茶树种子，以及在茶树种子的质押仓位（slot）的位置决定。
Plan - 种植，Camellia被种植以后即开始挖矿，所得收益以TEA计算。每次种植一棵茶树种子需要锁定1000T。
Unplan -去种植，茶树的主人可以选择将已种植的茶树去种植；如果该茶树上面有其他人的质押，茶树的主人需要向每个质押仓位支付100T来完成去种植。去种植以后，被锁定的1000T将解锁。去种植的茶树可以重新被种植。
Locked TEA - 锁定的TEA，每次种植一棵茶树需要锁定1000T。茶树被unplant或者自然死亡之后，被锁定的1000T才会被解锁。
Staking Debts - 质押债务，在种植茶树的时候，如果用户TEA余额不到1000T，系统会自动将种植茶树需要锁定的1000T放入质押债务。挖矿收益TEA自动偿还质押债务，并放入锁定账户。如果用户去种植，种植这颗茶树产生的质押债务将被免除。

Stake - 质押是TEA的一种再投资行为；每棵茶树种子上面有质押仓位（shot)，茶树种子的主人在种植茶树后占据最下面的仓位；后进入的投资者依照投资先后依次占据质押仓位，不同的质押仓位收益不同；如果中间有人退出质押，质押仓位依次往下挪。质押物可以用TEA（1000T 占据一个质押仓位）或者解冻后的茶树种子（一个茶树种子占据一个质押仓位）。被质押越多的茶树，有更高概率增加挖矿收益。
Collateral Loan - 抵押贷款，茶树种子（包括尚未解冻的种子）可以通过抵押贷款获得TEA，将之用于投资产生收益。每个茶树种子抵押贷款额为500T，利息为0.08%/33000区块。抵押贷款的期限为48小时；逾期没有赎回的茶树种子将被DAO拍卖。
COFFEE-在冷启动解冻引入的一种Token。挖矿竞赛参与者都会自动获得2000COFFEE作为冷启动的资金。COFFEE和TEA可以自由兑换，兑换汇率由自动化市商决定（AMM)。
Marketplace - 交易市场，用户可以在这里拍卖自己的茶树种子或者购买别人的茶树种子。
Leader board - 挖矿竞赛排名，用户可以看到所有矿工的挖矿收益排名，计算为7日挖矿收益预测，TEA余额和COFFEE余额之和减去质押债务和抵押债务。
